# 1. Import libraries -

In [1]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sns

# 2. Import the dataframe -

In [2]:
df = pd.read_csv("Data2.csv")

In [3]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

# Where is the Nan value in this dataframe -

In [4]:
df.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

# 3. Handling the missing values -

In [5]:
df = df.fillna(df.mean())

C:\Windows\Temp\ipykernel_11432\114435927.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df = df.fillna(df.mean())

In [6]:
df

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes

# 4. Encoding the categorical data -

In [9]:
x = df[["Country","Age","Salary"]].values
y = df[["Purchased"]].values

In [10]:
from sklearn.preprocessing import LabelEncoder

In [14]:
label_encoder = LabelEncoder()
x = df["Country"] = label_encoder.fit_transform(df["Country"])
y = df["Purchased"]=  label_encoder.fit_transform(df["Purchased"])

In [15]:
x

array([0, 2, 1, 2, 1, 0, 2, 0, 1, 0], dtype=int64)

In [16]:
y

array([0, 1, 0, 0, 1, 1, 0, 1, 0, 1])

**but i have to convert the Country in different form**

In [17]:
x = pd.get_dummies(df,columns = ["Country"],prefix = "Country")

In [18]:
x

         Age        Salary  Purchased  Country_0  Country_1  Country_2
0  44.000000  72000.000000          0          1          0          0
1  27.000000  48000.000000          1          0          0          1
2  30.000000  54000.000000          0          0          1          0
3  38.000000  61000.000000          0          0          0          1
4  40.000000  63777.777778          1          0          1          0
5  35.000000  58000.000000          1          1          0          0
6  38.777778  52000.000000          0          0          0          1
7  48.000000  79000.000000          1          1          0          0
8  50.000000  83000.000000          0          0          1          0
9  37.000000  67000.000000          1          1          0          0

# 5. train_test_split the data

In [20]:
from sklearn.model_selection import train_test_split

In [24]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size = 0.7,random_state = 0)

In [25]:
x_train

    Age   Salary  Purchased  Country_0  Country_1  Country_2
3  38.0  61000.0          0          0          0          1
0  44.0  72000.0          0          1          0          0
5  35.0  58000.0          1          1          0          0

In [26]:
x_test

         Age        Salary  Purchased  Country_0  Country_1  Country_2
2  30.000000  54000.000000          0          0          1          0
8  50.000000  83000.000000          0          0          1          0
4  40.000000  63777.777778          1          0          1          0
9  37.000000  67000.000000          1          1          0          0
1  27.000000  48000.000000          1          0          0          1
6  38.777778  52000.000000          0          0          0          1
7  48.000000  79000.000000          1          1          0          0

In [27]:
y_train

array([0, 0, 1])

In [28]:
y_test

array([0, 0, 1, 1, 1, 0, 1])